In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
type(df)
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
From_To         5 non-null object
FlightNumber    3 non-null float64
RecentDelays    5 non-null object
Airline         5 non-null object
dtypes: float64(1), object(3)
memory usage: 240.0+ bytes

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [3]:
##Question-1 : Fill in these missing numbers and make the column an integer column (instead of a float column)
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df.FlightNumber

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [4]:
###Question-2 : The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.
df['From_To'] = df.From_To.str.replace("_"," ")
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon paris         10045      [23, 47]               KLM(!)
1      MAdrid miLAN         10055            []    <Air France> (12)
2  londON StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest PaRis         10075          [13]       12. Air France
4   Brussels londOn         10085      [67, 32]          "Swiss Air"

In [6]:
## Question-3 : Standardise the strings so that only the first letter is uppercase (e.g."londON" should become "London")
df.From_To.str.capitalize()

0        London paris
1        Madrid milan
2    London stockholm
3      Budapest paris
4     Brussels london
Name: From_To, dtype: object

In [8]:
###Question-4 : Delete the From_To column from df and attach the temporary DataFrame from the previous questions.
df['From_To'] = df.From_To.str.capitalize()
df

            From_To  FlightNumber  RecentDelays              Airline
0      London paris         10045      [23, 47]               KLM(!)
1      Madrid milan         10055            []    <Air France> (12)
2  London stockholm         10065  [24, 43, 87]  (British Airways. )
3    Budapest paris         10075          [13]       12. Air France
4   Brussels london         10085      [67, 32]          "Swiss Air"

In [11]:
###Question-5 : Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.
df.assign(**pd.DataFrame(df['RecentDelays'].tolist()).add_prefix('Delay_'))

,From_To,FlightNumber,RecentDelays,Airline,Delay_0,Delay_1,Delay_2
0,London paris,10045,"[23, 47]",KLM(!),23.0,47.0,NaN
1,Madrid milan,10055,[],<Air France> (12),NaN,NaN,NaN
2,London stockholm,10065,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
3,Budapest paris,10075,[13],12. Air France,13.0,NaN,NaN
4,Brussels london,10085,"[67, 32]","""Swiss Air""",67.0,32.0,NaN